In [1]:
import pandas as pd
import matplotlib.pyplot as plt
train = pd.read_csv('../AVblackFriday/train.csv')
test = pd.read_csv('../AVblackFriday/test.csv')
yproductID = test['Product_ID']
yuserID = test['User_ID']

In [2]:
train.dtypes

User_ID                         int64
Product_ID                     object
Gender                         object
Age                            object
Occupation                      int64
City_Category                  object
Stay_In_Current_City_Years     object
Marital_Status                  int64
Product_Category_1              int64
Product_Category_2            float64
Product_Category_3            float64
Purchase                        int64
dtype: object

In [3]:
train.describe()

,User_ID,Occupation,Marital_Status,Product_Category_1,Product_Category_2,Product_Category_3,Purchase
count,5.500680e+05,550068.000000,550068.000000,550068.000000,376430.000000,166821.000000,550068.000000
mean,1.003029e+06,8.076707,0.409653,5.404270,9.842329,12.668243,9263.968713
std,1.727592e+03,6.522660,0.491770,3.936211,5.086590,4.125338,5023.065394
min,1.000001e+06,0.000000,0.000000,1.000000,2.000000,3.000000,12.000000
25%,1.001516e+06,2.000000,0.000000,1.000000,5.000000,9.000000,5823.000000
50%,1.003077e+06,7.000000,0.000000,5.000000,9.000000,14.000000,8047.000000
75%,1.004478e+06,14.000000,1.000000,8.000000,15.000000,16.000000,12054.000000
max,1.006040e+06,20.000000,1.000000,20.000000,18.000000,18.000000,23961.000000

In [4]:
train['Age'].unique()

array(['0-17', '55+', '26-35', '46-50', '51-55', '36-45', '18-25'],
      dtype=object)

In [5]:
train['Product_ID'].nunique()

3631

In [6]:
train['City_Category'].value_counts()

B    231173
C    171175
A    147720
Name: City_Category, dtype: int64

In [7]:
train['Stay_In_Current_City_Years'].value_counts()

1     193821
2     101838
3      95285
4+     84726
0      74398
Name: Stay_In_Current_City_Years, dtype: int64

In [8]:
train['Marital_Status'].unique()

array([0, 1], dtype=int64)

In [9]:
train.dtypes

User_ID                         int64
Product_ID                     object
Gender                         object
Age                            object
Occupation                      int64
City_Category                  object
Stay_In_Current_City_Years     object
Marital_Status                  int64
Product_Category_1              int64
Product_Category_2            float64
Product_Category_3            float64
Purchase                        int64
dtype: object

In [10]:
test.dtypes

User_ID                         int64
Product_ID                     object
Gender                         object
Age                            object
Occupation                      int64
City_Category                  object
Stay_In_Current_City_Years     object
Marital_Status                  int64
Product_Category_1              int64
Product_Category_2            float64
Product_Category_3            float64
dtype: object

# Converting Categorical variables into labels

In [11]:
from sklearn.preprocessing import LabelEncoder
lb = LabelEncoder()
def PreProcess(df):
    df['productID'] = lb.fit_transform(df['Product_ID'])
    df['gender'] = lb.fit_transform(df['Gender'])
    df['age'] = lb.fit_transform(df['Age'])
    df['city'] = lb.fit_transform(df['City_Category'])
    df['cityYears'] = lb.fit_transform(df['Stay_In_Current_City_Years'])

In [12]:
PreProcess(train)
train = train.drop(['Product_ID','Gender','Age','City_Category','Stay_In_Current_City_Years'], 1)
train.dtypes

User_ID                 int64
Occupation              int64
Marital_Status          int64
Product_Category_1      int64
Product_Category_2    float64
Product_Category_3    float64
Purchase                int64
productID               int64
gender                  int64
age                     int64
city                    int64
cityYears               int64
dtype: object

In [13]:
PreProcess(test)
test = test.drop(['Product_ID','Gender','Age','City_Category','Stay_In_Current_City_Years'], 1)
test.dtypes

User_ID                 int64
Occupation              int64
Marital_Status          int64
Product_Category_1      int64
Product_Category_2    float64
Product_Category_3    float64
productID               int64
gender                  int64
age                     int64
city                    int64
cityYears               int64
dtype: object

# Taking up Product_Categories

In [14]:
train.apply(lambda x: sum(x.isnull()))

User_ID                    0
Occupation                 0
Marital_Status             0
Product_Category_1         0
Product_Category_2    173638
Product_Category_3    383247
Purchase                   0
productID                  0
gender                     0
age                        0
city                       0
cityYears                  0
dtype: int64

In [15]:
#import numpy as np
#train['Product_Category_2'] = train['Product_Category_2'].astype(np.int64)

In [16]:
train[['Product_Category_1','Product_Category_2',"Product_Category_3"]].sample(10)

        Product_Category_1  Product_Category_2  Product_Category_3
512453                   1                14.0                 NaN
226415                  10                14.0                16.0
283993                   1                 6.0                16.0
172759                   5                 NaN                 NaN
171355                  10                16.0                 NaN
54983                    8                 NaN                 NaN
395477                   4                 5.0                 NaN
233069                   5                 8.0                 NaN
378805                   8                 9.0                 NaN
467939                   1                 2.0                13.0

In [17]:
train[train['Product_Category_2'].isnull()].head(10)

,User_ID,Occupation,Marital_Status,Product_Category_1,Product_Category_2,Product_Category_3,Purchase,productID,gender,age,city,cityYears
0,1000001,10,0,3,NaN,NaN,8370,672,0,0,0,2
2,1000001,10,0,12,NaN,NaN,1422,852,0,0,0,2
4,1000002,16,0,8,NaN,NaN,7969,2734,1,6,2,4
9,1000005,20,1,8,NaN,NaN,7871,2631,1,2,0,1
11,1000005,20,1,8,NaN,NaN,3957,140,1,2,0,1
12,1000005,20,1,8,NaN,NaN,6073,307,1,2,0,1
21,1000008,12,1,8,NaN,NaN,9872,1469,1,2,2,4
22,1000008,12,1,8,NaN,NaN,9743,2029,1,2,2,4
23,1000008,12,1,8,NaN,NaN,5982,2036,1,2,2,4
26,1000009,17,0,8,NaN,NaN,5887,391,1,2,2,0

In [18]:
train['productID'][train['Product_Category_2'].isnull()].unique()

array([ 672,  852, 2734, ..., 3560, 3566, 3565], dtype=int64)

In [19]:
len(train['productID'][train['Product_Category_2'].isnull()].unique())
#indicates that

1828

In [20]:
#find user_ID is different, productID is same and product_Category_2 is NaN
#train['Product_Category_2'][train['productID'] ==]
train2 = train
len(train[['User_ID', 'productID', 'Product_Category_2']][train['productID'] == train2['productID']][train['User_ID'] != train2['User_ID']][train['Product_Category_2'].isnull()])

C:\Anaconda3\lib\site-packages\ipykernel_launcher.py:4: UserWarning: Boolean Series key will be reindexed to match DataFrame index.
  after removing the cwd from sys.path.

0

In [21]:
train[train['Product_Category_3'].isnull()].head(10)

,User_ID,Occupation,Marital_Status,Product_Category_1,Product_Category_2,Product_Category_3,Purchase,productID,gender,age,city,cityYears
0,1000001,10,0,3,NaN,NaN,8370,672,0,0,0,2
2,1000001,10,0,12,NaN,NaN,1422,852,0,0,0,2
3,1000001,10,0,12,14.0,NaN,1057,828,0,0,0,2
4,1000002,16,0,8,NaN,NaN,7969,2734,1,6,2,4
5,1000003,15,0,1,2.0,NaN,15227,1831,1,2,0,3
7,1000004,7,1,1,15.0,NaN,15854,3320,1,4,1,2
8,1000004,7,1,1,16.0,NaN,15686,3604,1,4,1,2
9,1000005,20,1,8,NaN,NaN,7871,2631,1,2,0,1
10,1000005,20,1,5,11.0,NaN,5254,2398,1,2,0,1
11,1000005,20,1,8,NaN,NaN,3957,140,1,2,0,1

In [22]:
len(train['User_ID'][train['Product_Category_3'].isnull()])

383247

In [23]:
len(train[train['Product_Category_3'].isnull()][train['Product_Category_2'].isnull()])

C:\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: UserWarning: Boolean Series key will be reindexed to match DataFrame index.
  """Entry point for launching an IPython kernel.

173638

In [24]:
train[['Product_Category_3']][train['Product_Category_2'].isnull()].sum()
#this proves all rows where Product_Category_2 is null, Product_Category_3 is also null

Product_Category_3    0.0
dtype: float64

In [25]:
train.shape

(550068, 12)

**1. Replacing all NaNs**

In [26]:
Xtrain= train

In [27]:
Xtrain.shape

(550068, 12)

In [28]:
Xtrain.fillna(0, inplace=True)

In [29]:
Xtrain.head(10)

,User_ID,Occupation,Marital_Status,Product_Category_1,Product_Category_2,Product_Category_3,Purchase,productID,gender,age,city,cityYears
0,1000001,10,0,3,0.0,0.0,8370,672,0,0,0,2
1,1000001,10,0,1,6.0,14.0,15200,2376,0,0,0,2
2,1000001,10,0,12,0.0,0.0,1422,852,0,0,0,2
3,1000001,10,0,12,14.0,0.0,1057,828,0,0,0,2
4,1000002,16,0,8,0.0,0.0,7969,2734,1,6,2,4
5,1000003,15,0,1,2.0,0.0,15227,1831,1,2,0,3
6,1000004,7,1,1,8.0,17.0,19215,1745,1,4,1,2
7,1000004,7,1,1,15.0,0.0,15854,3320,1,4,1,2
8,1000004,7,1,1,16.0,0.0,15686,3604,1,4,1,2
9,1000005,20,1,8,0.0,0.0,7871,2631,1,2,0,1

In [30]:
Xtrain.apply(lambda x: sum(x.isnull()))

User_ID               0
Occupation            0
Marital_Status        0
Product_Category_1    0
Product_Category_2    0
Product_Category_3    0
Purchase              0
productID             0
gender                0
age                   0
city                  0
cityYears             0
dtype: int64

**Working in test dataset**

In [31]:
Xtest = test

In [32]:
Xtest.fillna(0, inplace=True)

In [33]:
Xtest.shape

(233599, 11)

In [34]:
Xtest.apply(lambda x: sum(x.isnull()))

User_ID               0
Occupation            0
Marital_Status        0
Product_Category_1    0
Product_Category_2    0
Product_Category_3    0
productID             0
gender                0
age                   0
city                  0
cityYears             0
dtype: int64

# Model training

In [35]:
ytrain = Xtrain['Purchase']
print(ytrain.shape)
Xtrain = train.iloc[:, train.columns != 'Purchase']
print(Xtrain.shape)

(550068,)
(550068, 11)

In [36]:
Xtrain.dtypes

User_ID                 int64
Occupation              int64
Marital_Status          int64
Product_Category_1      int64
Product_Category_2    float64
Product_Category_3    float64
productID               int64
gender                  int64
age                     int64
city                    int64
cityYears               int64
dtype: object

In [37]:
from sklearn.ensemble import GradientBoostingRegressor
gbrt = GradientBoostingRegressor()

In [38]:
%time gbrt.fit(Xtrain,ytrain)

Wall time: 57.2 s

GradientBoostingRegressor(alpha=0.9, criterion='friedman_mse', init=None,
             learning_rate=0.1, loss='ls', max_depth=3, max_features=None,
             max_leaf_nodes=None, min_impurity_decrease=0.0,
             min_impurity_split=None, min_samples_leaf=1,
             min_samples_split=2, min_weight_fraction_leaf=0.0,
             n_estimators=100, presort='auto', random_state=None,
             subsample=1.0, verbose=0, warm_start=False)

In [39]:
%time ypred = gbrt.predict(Xtest)

Wall time: 427 ms

In [40]:
output = pd.DataFrame(columns=['User_ID', 'Product_ID', 'Purchase'])
output.dtypes

User_ID       object
Product_ID    object
Purchase      object
dtype: object

In [41]:
output['User_ID'] = yuserID
output['Product_ID'] = yproductID 
output['Purchase'] = ypred

In [42]:
output.to_csv('m1.csv', index=False)